## Desafio 05. Tamanhos das equipes dos gerentes

### Bibliotecas

In [1]:
import pandas as pd

# Módulo de conexão com banco
import sys
sys.path.append('../') 
import funcoesconexao as con

# Desativa warnings
import warnings
warnings.filterwarnings('ignore')

### Carregamento dos Dados

#### Via banco de dados — SQL Server

In [2]:
conexao = con.conectar_bd()

----- Conexão com banco de dados estabelecida com sucesso! -----

In [3]:
# Carregando dataframes
df_gerentes             = con.carregar_dados(conexao, 'gerentes')
df_funcionarios_equipes = con.carregar_dados(conexao, 'funcionarios_equipes')

# Fechando conexão
con.fechar_conexao_bd(conexao)

In [4]:
# Exibindo dataframes
display(df_gerentes.head())
display(df_funcionarios_equipes.head())

   id            nome    equipe
0   1      João Silva  Equipe A
1   2  Maria Oliveira  Equipe B
2   3   Carlos Santos  Equipe C
3   4   Ana Rodrigues  Equipe D
4   5     Pedro Sousa  Equipe E

   id              nome  gerente_id
0   1     José Oliveira           1
1   2   Patrícia Santos           1
2   3  Fernando Martins           1
3   4      Camila Silva           1
4   5   Ricardo Pereira           2

#### Via arquivo .CSV

In [5]:
# Carregando dataframes
df_gerentes             = con.carregar_dados_csv('gerentes.csv')
df_funcionarios_equipes = con.carregar_dados_csv('funcionarios_equipes.csv')

In [6]:
# Exibindo dataframes
display(df_gerentes.head())
display(df_funcionarios_equipes.head())

   id            nome    equipe
0   1      João Silva  Equipe A
1   2  Maria Oliveira  Equipe B
2   3   Carlos Santos  Equipe C
3   4   Ana Rodrigues  Equipe D
4   5     Pedro Sousa  Equipe E

   id              nome  gerente_id
0   1     José Oliveira           1
1   2   Patrícia Santos           1
2   3  Fernando Martins           1
3   4      Camila Silva           1
4   5   Ricardo Pereira           2

### Solução

In [7]:
def maior_equipe(funcionarios_equipes: pd.DataFrame, gerentes: pd.DataFrame):
    # Mesclando dataframes
    df_merge = pd.merge(funcionarios_equipes, gerentes, left_on='gerente_id', right_on='id', how='inner', suffixes=('', '_gerente'))
    
    # Agrupando equipes por gerente e calculando tamanho da equipe
    df_agrupado = df_merge.groupby('nome_gerente').agg(tamanho_equipe=('id', 'count'))
    
    # Ordenando dataframe pelo tamanho da equipe
    df_agrupado = df_agrupado.sort_values(by='tamanho_equipe', ascending=False).reset_index()
    
    # Selecionando gerente com maior equipe
    gerente_maior_equipe = df_agrupado.head(1)
    
    # Saída
    return gerente_maior_equipe

In [8]:
maior_equipe(df_funcionarios_equipes, df_gerentes)

    nome_gerente  tamanho_equipe
0  Ana Rodrigues               5